In [194]:
##The goal of this project is to webscrape a bookstore page and analyze that data

In [119]:
import requests
import bs4

In [120]:
base_url = "http://books.toscrape.com/catalogue/page-{}.html"

In [121]:
titles = []
price= []
stock= []
for n in range (1,51):
    scrape_url = base_url.format(n)
    res= requests.get(scrape_url)
    
    soup=bs4.BeautifulSoup(res.text,"lxml")
    books = soup.select(".product_pod")
    
    for book in books:
        book_title= book.select("a")[1]["title"]
        book_price=book.select(".price_color")[0]
        book_stock=soup.select(".instock.availability")[0]
        titles.append(book_title)
        price.append(book_price.text)
        stock.append(book_stock.text)

In [122]:
titles = []
price= []
stock= []
for n in range (1,51):
    scrape_url = base_url.format(n)
    res= requests.get(scrape_url)
    
    soup=bs4.BeautifulSoup(res.text,"lxml")
    books = soup.select(".product_pod")
    
    
    for book in books:
        book_title= book.select("a")[1]["title"]
        book_price=book.select(".price_color")[0]
        book_stock=soup.select(".instock.availability")[0]
        titles.append(book_title)
        price.append(book_price.text)
        stock.append(book_stock.text)

In [133]:
import pandas as pd
import numpy as np

In [154]:
value_1 = pd.DataFrame(titles,columns=["Book Titles"])
value_2 = pd.DataFrame(price,columns=["Book Prices(Pounds)"])
value_3 = pd.DataFrame(stock,columns=["Book Availability"])

In [155]:
frames = [value_1,value_2,value_3]
df = pd.concat(frames,axis=1)

In [156]:
df.head()

,Book Titles,Book Prices(Pounds),Book Availability
0,A Light in the Attic,Â£51.77,\n\n \n In stock\n \n
1,Tipping the Velvet,Â£53.74,\n\n \n In stock\n \n
2,Soumission,Â£50.10,\n\n \n In stock\n \n
3,Sharp Objects,Â£47.82,\n\n \n In stock\n \n
4,Sapiens: A Brief History of Humankind,Â£54.23,\n\n \n In stock\n \n

In [157]:
###DATA CLEANING

In [158]:
df["Book Prices(Pounds)"]= df['Book Prices(Pounds)'].map(lambda x:x[2:7])

In [159]:
df["Book Prices(Pounds)"].head()

0    51.77
1    53.74
2    50.10
3    47.82
4    54.23
Name: Book Prices(Pounds), dtype: object

In [160]:
df["Book Availability"][0][15:23]

'In stock'

In [161]:
df["Book Availability"]= df["Book Availability"].map(lambda x:x[15:23])

In [162]:
df.head()

                             Book Titles Book Prices(Pounds) Book Availability
0                   A Light in the Attic               51.77          In stock
1                     Tipping the Velvet               53.74          In stock
2                             Soumission               50.10          In stock
3                          Sharp Objects               47.82          In stock
4  Sapiens: A Brief History of Humankind               54.23          In stock

In [110]:
###Exploratory Data Analysis

In [163]:
df.describe()

                   Book Titles Book Prices(Pounds) Book Availability
count                     1000                1000              1000
unique                     999                 903                 1
top     The Star-Touched Queen               44.18          In stock
freq                         2                   3              1000

In [175]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Book Titles          1000 non-null   object
 1   Book Prices(Pounds)  1000 non-null   object
 2   Book Availability    1000 non-null   object
dtypes: object(3)
memory usage: 23.6+ KB

In [178]:
df["Book Prices(Pounds)"]= df["Book Prices(Pounds)"].astype(float)

In [179]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Book Titles          1000 non-null   object
 1   Book Prices(Pounds)  1000 non-null   float64
 2   Book Availability    1000 non-null   object
dtypes: float64(1), object(2)
memory usage: 23.6+ KB

In [184]:
df[["Book Titles","Book Prices(Pounds)"]].nlargest(10,columns=['Book Prices(Pounds)'])

                                           Book Titles  Book Prices(Pounds)
648                 The Perfect Play (Play by Play #1)                59.99
617                  Last One Home (New Beginnings #1)                59.98
860                   Civilization and Its Discontents                59.95
560                     The Barefoot Contessa Cookbook                59.92
366                          The Diary of a Young Girl                59.90
657  The Bone Hunters (Lexy Vaughan & Steven Macaul...                59.71
133  Thomas Jefferson and the Tripoli Pirates: The ...                59.64
387                      Boar Island (Anna Pigeon #19)                59.48
393                          The Improbability of Love                59.45
549  The Man Who Mistook His Wife for a Hat and Oth...                59.45

In [186]:
df["Book Prices(Pounds)"].mean()

35.07035

In [187]:
df.iloc[534]

Book Titles            Finding God in the Ruins: How God Redeems Pain
Book Prices(Pounds)                                             46.64
Book Availability                                            In stock
Name: 534, dtype: object

In [190]:
df.loc[df["Book Titles"]=='Set Me Free']

    Book Titles  Book Prices(Pounds) Book Availability
12  Set Me Free                17.46          In stock

In [193]:
df.loc[df["Book Prices(Pounds)"]<15]

,Book Titles,Book Prices(Pounds),Book Availability
10,"Starving Hearts (Triangular Trade Trilogy, #1)",13.99,In stock
20,In Her Wake,12.84,In stock
47,Untitled Collection: Sabbath Poems 2014,14.27,In stock
80,"Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Pr...",13.61,In stock
81,Princess Between Worlds (Wide-Awake Princess #5),13.34,In stock
...,...,...,...
934,The Girl You Lost,12.29,In stock
936,The End of the Jesus Era (An Investigation #1),14.40,In stock
938,The Complete Maus (Maus #1-2),10.64,In stock
939,The Communist Manifesto,14.76,In stock
946,Sister Sable (The Mad Queen #1),13.33,In stock

In [195]:
df[["Book Titles","Book Prices(Pounds)"]].nsmallest(10,columns=['Book Prices(Pounds)'])

                                           Book Titles  Book Prices(Pounds)
638                         An Abundance of Katherines                10.00
501                              The Origin of Species                10.01
716  The Tipping Point: How Little Things Can Make ...                10.02
84                                            Patience                10.16
302                               Greek Mythic History                10.23
558  The Fellowship of the Ring (The Lord of the Ri...                10.27
479                                  History of Beauty                10.29
242  The Lucifer Effect: Understanding How Good Peo...                10.40
434  NaNo What Now? Finding your editing process, r...                10.41
274                                       Pet Sematary                10.56